/****************************************************************************
 * kuil.h
 * --------------------------------------------------------------------------
 * interfaces
 * --------------------------------------------------------------------------
 * Copyright(c) 2012 NFRI. All Rights Reserved.
 * --------------------------------------------------------------------------
 * 2012.07.03  yunsw        Initial revision
 ****************************************************************************/

/**
 * \file    kutil.h
 * \ingroup kutil
 * \brief   kutil 라이브러리의 인터페이스 제공
 * 
 * 본 파일은 kutil 라이브러리의 API들을 사용하는데 필요한 헤더를 포함한다. \n
 * C/C++ 사용자 애플리케이션에서는, 본 헤더 파일을 포함 하도록 한다.
 */

#ifndef __KUTIL_H
#define __KUTIL_H

#include "kuCommon.h"
#include "kuTime.h"
#include "kuDebug.h"

#endif	// __KUTIL_H

